In [1]:
#4.4.3 LOAD AND READ CSV FILES
#In the first cell of your PyCitySchools.ipynb file, import the Pandas library as the dependency and run the cell.

# Add the Pandas dependency.
import pandas as pd

In [2]:
#n the next cell, declare two variables: one assigned to the schools_complete.csv file and one assigned to the 
#students_complete.csv file. (These files are located in the Resources folder.) Your code should look like this: 

# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [4]:
#4.5.1
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
#Count() method 
#Determine if there are any missing values in the school data.
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
# Determine if there are any missing values in the student data.
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
#When you apply the isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, either 
#"True" for the row or rows that are empty, i.e., null, or "False" for the rows that are not empty.

# Determine if there are any missing values in the school data.
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [8]:
#Now we'll use the same method on the student_data_df DataFrame. Add the following code to a new cell and run 
#the cell:
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [9]:
#isnull method
# To get the total number of empty rows, or rows that are "True," we can use the Pandas sum() method 
#after the isnull() method, like this:
# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [10]:
#notnull method... basically the reverse of isnull method 
#Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [11]:
#Like we did with the student_data_df DataFrame, we can chain the notnull() method and the sum() method to get 
#the sum of all the columns that are "True."
# Determine if there are not any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [12]:
#4.5.3
#With the Pandas library, we can check the data types of each column by using the Pandas dtypes attribute on a 
#DataFrame.

#To determine the data types in school_data.csv, type and run the following code:

# Determine data types for the school DataFrame.
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [13]:
# Determine data types for the student DataFrame.
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [14]:
#4.5.7
# For the previous data-cleaning step (in cleaning_student_names), we created a list to hold the common prefixes and suffixes as strings like this:

# prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# We iterated through the list and used the replace() method on the "student_name" column, replacing every occurrence 
# of each prefix or suffix as they occurred with an empty string.

# To initialize the list, add the following code to a new cell in your PyCitySchools.ipynb file. 
# Make sure that there is a space after the prefix and before the suffix.

# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [15]:
# Next, add the following code below the prefixes_suffixes list. This is similar to the code we used in the cleaning_student_names.ipynb file.
# This step is to change from oobject to string
# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

In [16]:
student_data_df.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [17]:
#Now we have a clean student_data_df DataFrame, which means we can finally start our analysis!

In [18]:
# 4.7.1 Merge Dataframes

# We'll merge school_data_df and student_data_dfon a shared column using the merge() method. The column that these 
# DataFrames have in common is school_name. Inside the parentheses of the merge() method, we'll do the following:

# Add the DataFrames to be merged.
# Add the shared column to each DataFrame so that the merge can occur.
# Define how the DataFrames should be merged: left, right, inner, or outer. The default is inner. 
# (You will learn more about merging later in this course.)

In [19]:
# We create a new DataFrame for the merged DataFrames, called school_data_complete_df.
# The new DataFrame is created as a result of merging DataFrame #2 (school_data_df), which is the "right" DataFrame, 
# into DataFrame #1 (student_data_df), which is the "left" DataFrame. We refer to the DataFrames as "left" and "right" 
# to reflect the order they appear inside the parentheses.
# We use the parameter "on," which is equal to a list of the columns that are identical from each DataFrame, in this 
# case, "school_name." We can also use the column name like this: on="school_name".

# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [20]:
# The data from student_data_df takes up the first seven columns, and the four columns from the school_data_df are 
# added at the end: School ID, type, size, and budget.

In [21]:
# There may be cases in which you want to merge on a column that has similar information in two separate DataFrames, 
# but is named differently in each—for example, "school_name" in one DataFrame and "high_school" in the second. 
# In these cases, you should rename the columns so that they match. This will help avoid duplicate columns or merging 
# issues.

In [22]:
# 4.7.2 get the number of students 

# If we add the count() method to the school_data_complete_df DataFrame, we will count all the items in each row for 
# each column that is not null. Run the following code:

# Get the total number of students.
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [23]:
# In the output, we see that each column has 39,170 rows, or values. Therefore, we can choose any one of the columns and get the 
# student count using the following format:

# school_data_complete_df[column].count()

#To assign the "student_count" to a column that identifies with students, we will use the "Student ID" column.

school_data_complete_df["Student ID"].count()

39170

In [24]:
# 4.7.3 Get the number of schools

# There are two ways we can get the number of schools. One is to use the school_data_df DataFrame and assign a 
# variable to one of the columns in the DataFrame, like this:

# Calculate the total number of schools.
school_count = school_data_df["school_name"].count()
school_count

15

In [25]:
# We can't use the count() method on the school_data_complete_df["school_name"] column because this would give us a 
# value of 39,170. If we want to use school_data_complete_df, we first need to get the unique items in the 
# ["school_name"] column by using the unique() method. This method will return an array, or list, of all the unique values of that column.

# Add the following code to a new cell and run the cell. The output is shown below. 

# Calculate the total number of schools
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [26]:
# get the number of items in a list
len(school_count_2)

15

In [27]:
# OR
len(school_data_complete_df["school_name"].unique())

15

In [28]:
# 4.7.4 Get the total budget 

# Instead of using the sum() on the school_data_complete_df["budget"] column, we should use sum() on the 
# school_data_df["budget"] column.

# Add the following code to a new cell and run the cell.

# Calculate the total budget.
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [29]:
# Compare to the sum() of budget on excel to double check.

In [30]:
# 4.7.5 Get the score averages 

# Open the student_data.csv file and look at the data.

#The averages can be determined by clicking inside an empty cell and adding the =average() function for the 
# "reading_score" and "math_score" columns.

# Reading 81.87784018
# Math 78.98537146

# The Pandas method for getting the average of columns is the mean() method.

In [31]:
# Find the Average Reading Score
# Using the school_data_complete_df DataFrame, we can get the average reading score using the following code:

# Calculate the average reading score.
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [32]:
# Find the Average Math Score
# Now we'll repurpose the code for the average reading score to find the average math score, replacing 
# average_reading_score with average_math_score.

#Run the following code:

# Calculate the average math score.
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [33]:
# 4.7.6 Get the passing percentage

#To get the percentage of students who passed math and reading, we will write code to:

# 1. Determine the passing grade.
# 2. Get the number of students who passed math and reading in separate DataFrames.
# 3. Calculate the number of students who passed math and reading.
# 4. Calculate the percentage of students who passed math and reading.

#To get the overall passing percentage, we will write code to:

# 1. Get the number of students who passed both math and reading in a DataFrame.
# 2. Calculate the number of students who passed both math and reading.
# 3. Calculate the percentage of students who passed both math and reading.

In [34]:
# Determine the Passing Grade
# For math and reading assessment tests in this school district, the passing score was 70. Therefore, we need to 
# get all the math and reading scores that are greater than or equal to 70. 

# To do this, in a new cell, assign a passing_math variable to the math_score column in school_data_complete_df, 
# where all the math scores are equal to or greater than 70.

passing_math = school_data_complete_df["math_score"] >= 70
passing_reading = school_data_complete_df["reading_score"] >= 70

In [35]:
# To find the passing_math variable, run passing_math in a new cell. The result is Boolean values for the rows, 
# where "True" means the score is equal to or greater than 70, and "False" means the score is not equal to or greater 
# than 70.


passing_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [36]:
# When we execute the code for passing_reading, we will get Boolean values for each row, where "True" means the score 
# is equal to or greater than 70, and "False" means the score is not equal to or greater than 70.

passing_reading

0        False
1         True
2         True
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: reading_score, Length: 39170, dtype: bool

In [37]:
# Get the Number of Students Who Passed Math and Reading
# To get all the students who passed math and all the students who passed reading, we need to filter our 
# school_data_complete_df DataFrame for the "True" cases. In other words, get only the students who have a grade is 
# equal or greater to 70.

# We can filter the school_data_complete_df DataFrame by adding the school_data_complete_df["math_score"] >= 70 
# within brackets, like this:

# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [38]:
# Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [39]:
# To get the number of students who passed math and reading, apply the count() method to the student_name column of 
# the passing_math and passing_reading DataFrames, like this:

# Calculate the number of students passing math.
passing_math_count = passing_math["student_name"].count()

# Calculate the number of students passing reading.
passing_reading_count = passing_reading["student_name"].count()

In [40]:
print(passing_reading_count)
print(passing_math_count)

33610
29370

In [41]:
school_data_complete_df["Student ID"].count()

39170

In [42]:
# Calculate the percent that passed math.
passing_math_percentage = passing_math_count / float(student_count) * 100

# Calculate the percent that passed reading.
passing_reading_percentage = passing_reading_count / float(student_count) * 100

In [43]:
print(passing_math_percentage)
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [44]:
# Calculate the Overall Passing Percentage

# To get the overall passing percentage, we need to get all the students who passed both math and reading and 
# divide by the total number of students.

# We can filter the school_data_complete_df DataFrame by adding the school_data_complete_df["math_score"] >= 70 
# and school_data_complete_df["reading_score"] >= 70 with the logical operator "&" within brackets, like this:

# Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [45]:
# To get the total number of students who passed both math and reading, we apply the count()method to the 
# passing_math_reading DataFrame with the following code.
    
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [46]:
# Finally, we calculate the percentage of students who passed both math and reading by dividing the total number of 
# students and multiplying by 100, using the following code.

# Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

In [47]:
# This completes the data we need for the district summary. Now we'll add it to a new DataFrame.

# Now that we have performed all the calculations needed for the district summary, let's add the following values 
# and columns to a new DataFrame named district_summary_df.

# Total number of schools in the column "Total Schools"
# Total number of students in the column "Total Students"
# Total budget in the column "Total Budget"
# Average reading score in the column "Average Reading Score"
# Average math score in the column "Average Math Score"
# Percentage of students passing reading in the column "% Passing Reading"
# Percentage of students passing math in the column "% Passing Math"
# Overall passing percentage in the column "% Overall Passing"

# Remember, one way to create a new DataFrame is to convert a list of dictionaries to a DataFrame.

In [48]:
# Remember, one way to create a new DataFrame is to convert a list of dictionaries to a DataFrame.

# To create district_summary_df DataFrame, we can create a list of dictionaries, where the keys are column names and 
# the values are the metrics we calculated. We do this because the DataFrame has no index, and lists have natural 
# indexing.

# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame(
          [{"Total Schools": school_count,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,
          "% Passing Reading": passing_reading_percentage,
          "% Overall Passing": overall_passing_percentage}])
# Format the columns.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [49]:
district_summary_df.dtypes

Total Schools             int64
Total Students           object
Total Budget             object
Average Math Score       object
Average Reading Score    object
% Passing Math           object
% Passing Reading        object
% Overall Passing        object
dtype: object

In [283]:
# 4.7.8 Format Columns
# format the grade averages to one decimal place 
# grade percentages to the nearest whole number percent; 
# add a thousands separator for numbers greater than 1,000.

# See function file for examples

In [284]:
# Using what we just learned, we can format the dollar amounts in the district_summary_df columns to two decimal places 
# with a U.S. dollar sign, and numbers larger than 999 with a thousands separator.

# Let's apply this formatting technique to format the Total Students column with a thousands separator using the 
# basic syntax:

# df["column"] = df["column"].map("{:,}".format)

# replace df["column"] with district_summary_df["Total Students"]

In [285]:
# Format the "Total Students" to have the comma for a thousands separator.
# district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

# district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [286]:
 # format the Total Budget column in the district_summary_df DataFrame with a U.S. dollar sign, and then format the
 # numbers with a thousands separator and to two decimal places using the following syntax: 
#    "${:,.2f}".format.

In [287]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

# district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

# district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [288]:
# We need to format the remaining columns accordingly:

# The "Average Reading Score" column will be formatted to one decimal place.
# The "Average Math Score" column will be formatted to one decimal place.
# The "% Passing Reading" column will be formatted to the nearest whole number percentage.
# The "% Passing Math" column will be formatted to the nearest whole number percentage
# The "% Overall Passing" column will be formatted to the nearest whole number percentage.

In [ ]:
# Had to make a copy. Had issues with dtypes. Combined last part of section 4.7.8 with line 48

In [ ]:
# Workaround for formatting

# .style.format() method
# inside parenthesis, use {} and for each column we can alter the format 

#      .style.format({"column_title_1":"${:,.2f}"})